iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
/*
  WebServer.cpp -  web server functions class

  Copyright (c) 2014 Luc Lebosse. All rights reserved.

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#include "../Grbl.h"

#if defined(ENABLE_WIFI) && defined(ENABLE_HTTP)

#include "WifiServices.h"
#include "ESPResponse.h"
#include "Serial2Socket.h"
#include "WebServer.h"
#include <WebSocketsServer.h>
#include <WiFi.h>
#include <FS.h>
#include <SPIFFS.h>
#ifdef ENABLE_SD_CARD
#include <SD.h>
#include "../SDCard.h"
#endif
#include <WebServer.h>
#include <ESP32SSDP.h>
#include <StreamString.h>
#include <Update.h>
#include <esp_wifi_types.h>
#ifdef ENABLE_MDNS
#include <ESPmDNS.h>
#endif
#ifdef ENABLE_SSDP
#include <ESP32SSDP.h>
#endif

#ifdef ENABLE_CAPTIVE_PORTAL
#include <DNSServer.h>
#include "JSONEncoder.h"
#include <Regexp.h>

namespace WebUI
{
    const byte DNS_PORT = 53;
    DNSServer dnsServer;
}

#endif
#include <esp_ota_ops.h>

// embedded response file if no files on SPIFFS
#include "NoFile.h"
#include "../Settings.h"
namespace WebUI
{
    const char SD_API_ENDPOINT[] = "/sd";

    // Default 404
    const char PAGE_404[] =
        "<HTML>\n<HEAD>\n<title>Redirecting...</title> \n</HEAD>\n<BODY>\n<CENTER>Unknown page : $QUERY$- you will be "
        "redirected...\n<BR><BR>\nif not redirected, <a href='http://$WEB_ADDRESS$'>click here</a>\n<BR><BR>\n<PROGRESS name='prg' "
        "id='prg'></PROGRESS>\n\n<script>\nvar i = 0; \nvar x = document.getElementById(\"prg\"); \nx.max=5; \nvar "
        "interval=setInterval(function(){\ni=i+1; \nvar x = document.getElementById(\"prg\"); \nx.value=i; \nif (i>5) "
        "\n{\nclearInterval(interval);\nwindow.location.href='/';\n}\n},1000);\n</script>\n</CENTER>\n</BODY>\n</HTML>\n\n";
    const char PAGE_CAPTIVE[] =
        "<HTML>\n<HEAD>\n<title>Captive Portal</title> \n</HEAD>\n<BODY>\n<CENTER>Captive Portal page : $QUERY$- you will be "
        "redirected...\n<BR><BR>\nif not redirected, <a href='http://$WEB_ADDRESS$'>click here</a>\n<BR><BR>\n<PROGRESS name='prg' "
        "id='prg'></PROGRESS>\n\n<script>\nvar i = 0; \nvar x = document.getElementById(\"prg\"); \nx.max=5; \nvar "
        "interval=setInterval(function(){\ni=i+1; \nvar x = document.getElementById(\"prg\"); \nx.value=i; \nif (i>5) "
        "\n{\nclearInterval(interval);\nwindow.location.href='/';\n}\n},1000);\n</script>\n</CENTER>\n</BODY>\n</HTML>\n\n";

    // Error codes for upload
    const int ESP_ERROR_AUTHENTICATION = 1;
    const int ESP_ERROR_FILE_CREATION = 2;
    const int ESP_ERROR_FILE_WRITE = 3;
    const int ESP_ERROR_UPLOAD = 4;
    const int ESP_ERROR_NOT_ENOUGH_SPACE = 5;
    const int ESP_ERROR_UPLOAD_CANCELLED = 6;
    const int ESP_ERROR_FILE_CLOSE = 7;

    Web_Server web_server;
    bool Web_Server::_setupdone = false;
    uint16_t Web_Server::_port = 0;
    long Web_Server::_id_connection = 0;
    UploadStatusType Web_Server::_upload_status = UploadStatusType::NONE;
    WebServer *Web_Server::_webserver = NULL;
    WebSocketsServer *Web_Server::_socket_server = NULL;
#ifdef ENABLE_AUTHENTICATION
    AuthenticationIP *Web_Server::_head = NULL;
    uint8_t Web_Server::_nb_ip = 0;
    const int MAX_AUTH_IP = 10;
#endif
    Web_Server::Web_Server()
    {
    }
    Web_Server::~Web_Server() { end(); }

    long Web_Server::get_client_ID() { return _id_connection; }

    bool Web_Server::begin()
    {
        bool no_error = true;
        _setupdone = false;
        if (http_enable->get() == 0)
        {
            return false;
        }
        _port = http_port->get();

        // create instance
        _webserver = new WebServer(_port);
#ifdef ENABLE_AUTHENTICATION
        // here the list of headers to be recorded
        const char *headerkeys[] = {"Cookie"};
        size_t headerkeyssize = sizeof(headerkeys) / sizeof(char *);
        // ask server to track these headers
        _webserver->collectHeaders(headerkeys, headerkeyssize);
#endif
        _socket_server = new WebSocketsServer(_port + 1);
        _socket_server->begin();
        _socket_server->onEvent(handle_Websocket_Event);

        // Websocket output
        Serial2Socket.attachWS(_socket_server);

        // events functions
        //_web_events->onConnect(handle_onevent_connect);
        // events management
        //  _webserver->addHandler(_web_events);

        // Websocket function
        //_web_socket->onEvent(handle_Websocket_Event);
        // Websocket management
        //_webserver->addHandler(_web_socket);

        // Web server handlers
        // trick to catch command line on "/" before file being processed
        _webserver->on("/", HTTP_ANY, handle_root);

        // Page not found handler
        _webserver->onNotFound(handle_not_found);

        // need to be there even no authentication to say to UI no authentication
        _webserver->on("/login", HTTP_ANY, handle_login);
        // firmware info as json
        _webserver->on("/firmware", HTTP_GET, handle_fwinfo);
        _webserver->on("/grblsettings", HTTP_GET, handle_grbl_settings);
        // web commands
        _webserver->on("/command", HTTP_ANY, handle_web_command);
        _webserver->on("/espcommand", HTTP_ANY, handle_esp_command);
        _webserver->on("/boundaries", HTTP_ANY, handle_file_boundary);
        _webserver->on("/command_silent", HTTP_ANY, handle_web_command_silent);

