iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
        // SPIFFS
        _webserver->on("/files", HTTP_ANY, handleFileList, SPIFFSFileupload);

        // web update
        _webserver->on("/updatefw", HTTP_ANY, handleUpdate, WebUpdateUpload);

#ifdef ENABLE_SD_CARD
        // Direct SD management
        _webserver->on(SD_API_ENDPOINT, HTTP_ANY, handle_direct_SDFileList, SDFile_direct_upload);
#endif

#ifdef ENABLE_CAPTIVE_PORTAL
        if (WiFi.getMode() == WIFI_AP)
        {
            // if DNSServer is started with "*" for domain name, it will reply with
            // provided IP to all DNS request
            dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
            grbl_send(CLIENT_ALL, "[MSG:Captive Portal Started]\r\n");
            _webserver->on("/generate_204", HTTP_ANY, handle_root);
            _webserver->on("/gconnectivitycheck.gstatic.com", HTTP_ANY, handle_root);
            // do not forget the / at the end
            _webserver->on("/fwlink/", HTTP_ANY, handle_root);
        }
#endif

#ifdef ENABLE_SSDP
        // SSDP service presentation
        if (WiFi.getMode() == WIFI_STA)
        {
            _webserver->on("/description.xml", HTTP_GET, handle_SSDP);
            // Add specific for SSDP
            SSDP.setSchemaURL("description.xml");
            SSDP.setHTTPPort(_port);
            SSDP.setName(wifi_config.Hostname());
            SSDP.setURL("/");
            SSDP.setDeviceType("upnp:rootdevice");
            /*Any customization could be here
        SSDP.setModelName (ESP32_MODEL_NAME);
        SSDP.setModelURL (ESP32_MODEL_URL);
        SSDP.setModelNumber (ESP_MODEL_NUMBER);
        SSDP.setManufacturer (ESP_MANUFACTURER_NAME);
        SSDP.setManufacturerURL (ESP_MANUFACTURER_URL);
        */

            // Start SSDP
            grbl_send(CLIENT_ALL, "[MSG:SSDP Started]\r\n");
            SSDP.begin();
        }
#endif
        grbl_send(CLIENT_ALL, "[MSG:HTTP Started]\r\n");
        // start webserver
        _webserver->begin();
#ifdef ENABLE_MDNS
        // add mDNS
        if (WiFi.getMode() == WIFI_STA)
        {
            MDNS.addService("http", "tcp", _port);
        }
#endif
        _setupdone = true;
        return no_error;
    }

    void Web_Server::end()
    {
        _setupdone = false;
#ifdef ENABLE_SSDP
        SSDP.end();
#endif // ENABLE_SSDP
#ifdef ENABLE_MDNS
        // remove mDNS
        mdns_service_remove("_http", "_tcp");
#endif
        if (_socket_server)
        {
            delete _socket_server;
            _socket_server = NULL;
        }

        if (_webserver)
        {
            delete _webserver;
            _webserver = NULL;
        }

#ifdef ENABLE_AUTHENTICATION
        while (_head)
        {
            AuthenticationIP *current = _head;
            _head = _head->_next;
            delete current;
        }
        _nb_ip = 0;
#endif
    }

    // Root of Webserver/////////////////////////////////////////////////////

    void Web_Server::handle_root()
    {
        String path = "/index.html";
        String contentType = getContentType(path);
        String pathWithGz = path + ".gz";
        // if have a index.html or gzip version this is default root page
        if ((SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) && !_webserver->hasArg("index") && // forcefallback
            _webserver->arg("index") != "yes")
        {
            if (SPIFFS.exists(pathWithGz))
            {
                path = pathWithGz;
            }

            File file = SPIFFS.open(path, FILE_READ);
            _webserver->streamFile(file, contentType);
            file.close();
            return;
        }

        // if no lets launch the default content
        _webserver->sendHeader("Content-Encoding", "gzip");
        _webserver->send_P(200, "text/html", PAGE_NOFILES, PAGE_NOFILES_SIZE);
    }

    // Handle not registred path on SPIFFS neither SD ///////////////////////
    void Web_Server::handle_not_found()
    {
        if (is_authenticated() == AuthenticationLevel::LEVEL_GUEST)
        {
            sendStatus(301, "Page not Found");
            return;
        }

        bool page_not_found = false;
        String path = _webserver->urlDecode(_webserver->uri());
        String contentType = getContentType(path);
        String pathWithGz = path + ".gz";

#ifdef ENABLE_SD_CARD
        if ((path.substring(0, 4) == SD_API_ENDPOINT + '/'))
        {
            // remove /SD
            path = path.substring(3);
            if (SDState::Idle != get_sd_state(true))
            {
                sendStatus(404, "Cannot open: " + path + ", SD is not available.");
            }
            if (SD.exists(pathWithGz) || SD.exists(path))
            {
                set_sd_state(SDState::BusyUploading);
                if (SD.exists(pathWithGz))
                {
                    path = pathWithGz;
                }
                File datafile = SD.open(path);
                if (datafile)
                {
                    vTaskDelay(1 / portTICK_RATE_MS);
                    size_t totalFileSize = datafile.size();
                    size_t i = 0;
                    bool done = false;
                    _webserver->setContentLength(totalFileSize);
                    _webserver->send(200, contentType, "");
                    uint8_t buf[1024];
                    while (!done)
                    {
                        vTaskDelay(1 / portTICK_RATE_MS);
                        int v = datafile.read(buf, 1024);
                        if ((v == -1) || (v == 0))
                        {
                            done = true;
                        }
                        else
                        {
                            _webserver->client().write(buf, 1024);
                            i += v;
                        }

                        if (i >= totalFileSize)
                        {
                            done = true;
                        }
                    }
                    datafile.close();
                    if (i != totalFileSize)
                    {
                        // error: TBD
                    }
                    set_sd_state(SDState::Idle);
                    return;
                }
                set_sd_state(SDState::Idle);
            }
            else
            {
                sendStatus(404, "Can not find " + path);
                return;
            }
        }
        else
#endif
            if (SPIFFS.exists(pathWithGz) || SPIFFS.exists(path))
        {
            if (SPIFFS.exists(pathWithGz))
            {
                path = pathWithGz;
            }
            File file = SPIFFS.open(path, FILE_READ);
            _webserver->streamFile(file, contentType);
            file.close();
            return;
        }
        else
        {
            page_not_found = true;
        }

        if (page_not_found)
        {
#ifdef ENABLE_CAPTIVE_PORTAL
            if (WiFi.getMode() == WIFI_AP)
            {
                String contentType = PAGE_CAPTIVE;
                String stmp = WiFi.softAPIP().toString();
                // Web address = ip + port
                String KEY_IP = "$WEB_ADDRESS$";
                String KEY_QUERY = "$QUERY$";
                if (_port != 80)
                {
                    stmp += ":";
                    stmp += String(_port);
                }
                contentType.replace(KEY_IP, stmp);
                contentType.replace(KEY_IP, stmp);
                contentType.replace(KEY_QUERY, _webserver->uri());
                _webserver->send(200, "text/html", contentType);
                //_webserver->sendContent_P(NOT_AUTH_NF);
                //_webserver->client().stop();
                return;
            }
#endif
            path = "/404.htm";
            contentType = getContentType(path);
            pathWithGz = path + ".gz";
            if (SPIFFS.exists(pathWithGz) || SPIFFS.exists(path))
            {
                if (SPIFFS.exists(pathWithGz))
                {
                    path = pathWithGz;
                }
                File file = SPIFFS.open(path, FILE_READ);
                _webserver->streamFile(file, contentType);
                file.close();
            }
            else
            {
                // if not template use default page
                contentType = PAGE_404;
                String stmp;
                if (WiFi.getMode() == WIFI_STA)
                {
                    stmp = WiFi.localIP().toString();
                }
                else
                {
                    stmp = WiFi.softAPIP().toString();
                }
                // Web address = ip + port
                String KEY_IP = "$WEB_ADDRESS$";
                String KEY_QUERY = "$QUERY$";
                if (_port != 80)
                {
                    stmp += ":";
                    stmp += String(_port);
                }
                contentType.replace(KEY_IP, stmp);
                contentType.replace(KEY_QUERY, _webserver->uri());
                _webserver->send(200, "text/html", contentType);
            }
        }
    }

#ifdef ENABLE_SSDP
    // http SSDP xml presentation
    void Web_Server::handle_SSDP()
    {
        StreamString sschema;
        if (sschema.reserve(1024))
        {
            String templ = "<?xml version=\"1.0\"?>"
                           "<root xmlns=\"urn:schemas-upnp-org:device-1-0\">"
                           "<specVersion>"
                           "<major>1</major>"
                           "<minor>0</minor>"
                           "</specVersion>"
                           "<URLBase>http://%s:%u/</URLBase>"
                           "<device>"
                           "<deviceType>upnp:rootdevice</deviceType>"
                           "<friendlyName>%s</friendlyName>"
                           "<presentationURL>/</presentationURL>"
                           "<serialNumber>%s</serialNumber>"
                           "<modelName>ESP32</modelName>"
                           "<modelNumber>Marlin</modelNumber>"
                           "<modelURL>http://espressif.com/en/products/hardware/esp-wroom-32/overview</modelURL>"
                           "<manufacturer>Espressif Systems</manufacturer>"
                           "<manufacturerURL>http://espressif.com</manufacturerURL>"
                           "<UDN>uuid:%s</UDN>"
                           "</device>"
                           "</root>\r\n"
                           "\r\n";
            char uuid[37];
            String sip = WiFi.localIP().toString();
            uint32_t chipId = (uint16_t)(ESP.getEfuseMac() >> 32);
            sprintf(uuid,
                    "38323636-4558-4dda-9188-cda0e6%02x%02x%02x",
                    (uint16_t)((chipId >> 16) & 0xff),
                    (uint16_t)((chipId >> 8) & 0xff),
                    (uint16_t)chipId & 0xff);
            String serialNumber = String(chipId);
            sschema.printf(templ.c_str(), sip.c_str(), _port, wifi_config.Hostname().c_str(), serialNumber.c_str(), uuid);
            _webserver->send(200, "text/xml", (String)sschema);
        }
        else
        {
            _webserver->send(500);
        }
    }
#endif

    void Web_Server::_handle_web_command(bool silent)
    {
        // to save time if already disconnected
        // if (_webserver->hasArg ("PAGEID") ) {
        //     if (_webserver->arg ("PAGEID").length() > 0 ) {
        //        if (_webserver->arg ("PAGEID").toInt() != _id_connection) {
        //        _webserver->send (200, "text/plain", "Invalid command");
        //        return;
        //        }
        //     }
        // }
        AuthenticationLevel auth_level = is_authenticated();
        String cmd = "";
        if (_webserver->hasArg("cmd"))
        {
            cmd = _webserver->arg("cmd");
        }
        else
        {
            sendStatus(400, "Missing command query parameter");
            return;
        }
        // if it is internal command [ESPXXX]<parameter>
        cmd.trim();
        int ESPpos = cmd.indexOf("[ESP");
        if (ESPpos > -1)
        {
            sendStatus(400, "Error ESP command should go to /espcommand");
        }
        else
        { // execute GCODE
            if (auth_level == AuthenticationLevel::LEVEL_GUEST)
            {
                sendStatus(401, "Authantication failed");
                return;
            }
            // Instead of send several commands one by one by web  / send full set and split here
            String scmd;
            bool hasError = false;
            uint8_t sindex = 0;
            // TODO Settings - this is very inefficient.  get_Splited_Value() is O(n^2)
            // when it could easily be O(n).  Also, it would be just as easy to push
            // the entire string into Serial2Socket and pull off lines from there.
            for (uint8_t sindex = 0; (scmd = get_Splited_Value(cmd, '\n', sindex)) != ""; sindex++)
            {
                // 0xC2 is an HTML encoding prefix that, in UTF-8 mode,
                // precede 0x90 and 0xa0-0bf, which are GRBL realtime commands.
                // There are other encodings for 0x91-0x9f, so I am not sure
                // how - or whether - those commands work.
                // Ref: https://www.w3schools.com/tags/ref_urlencode.ASP
                if (!silent && (scmd.length() == 2) && (scmd[0] == 0xC2))
                {
                    scmd[0] = scmd[1];
                    scmd.remove(1, 1);
                }
                if (scmd.length() > 1)
                {
                    scmd += "\n";
                }
                else if (!is_realtime_command(scmd[0]))
                {
                    scmd += "\n";
                }
                if (!Serial2Socket.push(scmd.c_str()))
                {
                    hasError = true;
                }
            }
            sendStatus(hasError ? 400 : 200, hasError ? "Error" : JSONencoder::ok);
        }
    }

    void Web_Server::_handle_esp_command(bool silent)
    {
        AuthenticationLevel auth_level = is_authenticated();
        String cmd = "";
        if (_webserver->hasArg("cmd"))
        {
            cmd = _webserver->arg("cmd");
        }
        else
        {
            sendStatus(400, "Missing command query parameter");
            return;
        }
        // if it is internal command [ESPXXX]<parameter>
        cmd.trim();
        // grbl_msg_sendf(CLIENT_SERIAL, MsgLevel::Info, _webserver->urlDecode(cmd).c_str());
        int ESPpos = cmd.indexOf("[ESP");
        if (ESPpos > -1)
        {
            char line[256];
            strncpy(line, cmd.c_str(), 255);
            ESPResponseStream *espresponse = silent ? nullptr : new ESPResponseStream(_webserver);
            Error err = system_execute_line(line, espresponse, auth_level);
            String answer;
            if (err == Error::Ok)
            {
                answer = JSONencoder::ok;
            }
            else
            {
                const char *msg = errorString(err);
                answer = "Error: ";
                if (msg)
                {
                    answer += msg;
                }
                else
                {
                    answer += static_cast<int>(err);
                }
            }
            if (!espresponse)
            {
                sendStatus(err != Error::Ok ? 400 : 200, answer);
            }
            delete (espresponse);
        }
        else
        {
            sendStatus(400, "Error not an ESP command");
        }
    }

