iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
    void Web_Server::handle_file_boundary()
    {
        AuthenticationLevel auth_level = is_authenticated();
        if (!_webserver->hasArg("filename") || !_webserver->hasArg("path"))
        {
            sendStatus(400, "Missing filename/path query parameter");
            return;
        }
        String filename;
        String path = "/";
        path += _webserver->arg("path");

        // to have a clean path
        path.trim();
        path.replace("//", "/");
        if (path[path.length() - 1] != '/')
        {
            path += "/";
        }

        String shortname = _webserver->arg("filename");
        filename = path + shortname;
        filename.replace("//", "/");

        if (get_sd_state(true) != SDState::Idle)
        {
            _upload_status = UploadStatusType::FAILED;
            grbl_send(CLIENT_ALL, "[MSG:Boundary cancelled]\r\n");
        }
        else
        {
            set_sd_state(SDState::BusyParsing);

            if (!SD.exists(filename))
            {
                sendStatus(404, "No such file " + filename);
                return;
            }
            else
            {
                File file = SD.open(filename, "r");
                char *lightBurnBoundsRegex = "Bounds: X(%d+%.*%d*) Y(%d+%.*%d*) to X(%d+%.*%d*) Y(%d+%.*%d*)";
                float minX = 0, maxX = 0, minY = 0, maxY = 0;
                char buf[10];
                bool lightburnmatch = false;
                while (file.available() && !lightburnmatch)
                {
                    auto line = file.readStringUntil('\n');
                    // if not comment
                    if (line.charAt(0) != ';')
                    {
                        int xIndex = line.indexOf("X");
                        int yIndex = line.indexOf("Y");

                        if (xIndex != -1)
                        {
                            float coordinate = getStringCoordinates(xIndex, line);
                            if (coordinate < minX)
                            {
                                minX = coordinate;
                            }
                            if (coordinate > maxX)
                            {
                                maxX = coordinate;
                            }
                        }

                        if (yIndex != -1)
                        {
                            float coordinate = getStringCoordinates(yIndex, line);

                            if (coordinate < minY)
                            {
                                minY = coordinate;
                            }
                            if (coordinate > maxY)
                            {
                                maxY = coordinate;
                            }
                        }
                    }
                    else
                    {
                        if (line.indexOf("Bounds:") != -1)
                        {
                            MatchState ms;
                            char dest[line.length()];
                            strcpy(dest, line.c_str());
                            ms.Target(dest);
                            char result = ms.Match(lightBurnBoundsRegex);
                            if (result == REGEXP_MATCHED)
                            {
                                char *capture = ms.GetCapture(buf, 0);
                                minX = strtof(capture, nullptr);
                                capture = ms.GetCapture(buf, 1);
                                minY = strtof(capture, nullptr);
                                capture = ms.GetCapture(buf, 2);
                                maxX = strtof(capture, nullptr);
                                capture = ms.GetCapture(buf, 3);
                                maxY = strtof(capture, nullptr);
                                lightburnmatch = true;
                            }
                        }
                    }
                }
                file.close();
                JSONencoder encoder;
                encoder.begin();
                encoder.member(JSONencoder::status, JSONencoder::ok);
                encoder.begin_named_object("bounds");
                encoder.memberf("minX", minX);
                encoder.memberf("maxX", maxX);
                encoder.memberf("minY", minY);
                encoder.memberf("maxY", maxY);
                encoder.member("lightburnMatch", lightburnmatch);
                encoder.end_object();
                _webserver->sendHeader("Cache-Control", "no-cache");
                _webserver->send(200, "application/json", encoder.end());
            }
            SD.end();
            set_sd_state(SDState::Idle);
        }
    }

    float Web_Server::getStringCoordinates(int startpos, const String line)
    {
        int numpos = ++startpos;
        while ((line.charAt(numpos) >= '0' && line.charAt(numpos) <= '9') || line.charAt(numpos) == '.' || line.charAt(numpos) == '-')
        {
            numpos++;
        }
        return strtof(line.substring(startpos, numpos).c_str(), nullptr);
    }

    void Web_Server::handle_fwinfo()
    {
        JSONencoder encoder;

        encoder.begin();

        encoder.member("FW_Version", GRBL_VERSION);
        encoder.member("FW_Build", GRBL_VERSION_BUILD);
        encoder.member("FW_Target", "grbl-embedded");

#ifdef ENABLE_SD_CARD
        encoder.member("FW_HW", "Direct SD");
#else
        encoder.member("FW_HW", "No SD");
#endif
        encoder.member("Primary_Sd", SD_API_ENDPOINT);
        encoder.member("Secondary_Sd", "none");
#ifdef ENABLE_AUTHENTICATION
        encoder.member("Authentication", "yes");
#else
        encoder.member("Authentication", "no");
#endif
#if defined(ENABLE_WIFI)
#if defined(ENABLE_HTTP)
        encoder.begin_named_object("Webcommunication");
        encoder.member("Mode", "Sync");
        encoder.member("Websocket_Port", String(web_server.port() + 1));
        encoder.member("Telnet_Port", String(8080));
        switch (WiFi.getMode())
        {
        case WIFI_MODE_AP:
            encoder.member("Wifi_Ip", WiFi.softAPIP().toString());
            break;
        case WIFI_MODE_STA:
            encoder.member("Wifi_Ip", WiFi.localIP().toString());
            break;
        case WIFI_MODE_APSTA:
            encoder.member("Wifi_Ip", WiFi.softAPIP().toString());
            break;
        default:
            encoder.member("Wifi_Ip", "0.0.0.0");
            break;
        }
#endif
        encoder.member("Hostname", wifi_config.Hostname());
        if (WiFi.getMode() == WIFI_AP)
        {
            encoder.member("Wifi_Mode", "AP");
        }
        else
        {
            encoder.member("Wifi_Mode", "STA");
        }
        encoder.end_object();
#endif
        // to save time in decoding `?`
        encoder.member("Axis_Count", String(number_axis->get()));

