iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
    // SPIFFS
    // SPIFFS files list and file commands
    void Web_Server::handleFileList()
    {
        AuthenticationLevel auth_level = is_authenticated();
        if (auth_level == AuthenticationLevel::LEVEL_GUEST)
        {
            _upload_status = UploadStatusType::NONE;
            sendStatus(401, "Authentication failed!");
            return;
        }

        String path;
        String status = JSONencoder::ok;
        if (_upload_status == UploadStatusType::FAILED)
        {
            status = "Upload failed";
            _upload_status = UploadStatusType::NONE;
        }
        _upload_status = UploadStatusType::NONE;

        // be sure root is correct according authentication
        if (auth_level == AuthenticationLevel::LEVEL_ADMIN)
        {
            path = "/";
        }
        else
        {
            path = "/user";
        }

        // get current path
        if (_webserver->hasArg("path"))
        {
            path += _webserver->arg("path");
        }

        // to have a clean path
        path.trim();
        path.replace("//", "/");
        if (path[path.length() - 1] != '/')
        {
            path += "/";
        }

        // check if query need some action
        if (_webserver->hasArg("action"))
        {
            // delete a file
            if (_webserver->arg("action") == "delete" && _webserver->hasArg("filename"))
            {
                String filename;
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename = path + _webserver->arg("filename");
                filename.replace("//", "/");
                if (!SPIFFS.exists(filename))
                {
                    status = shortname + " does not exists!";
                }
                else
                {
                    if (SPIFFS.remove(filename))
                    {
                        status = shortname + " deleted";
                        // what happen if no "/." and no other subfiles ?
                        String ptmp = path;
                        if ((path != "/") && (path[path.length() - 1] = '/'))
                        {
                            ptmp = path.substring(0, path.length() - 1);
                        }

                        File dir = SPIFFS.open(ptmp);
                        File dircontent = dir.openNextFile();
                        if (!dircontent)
                        {
                            // keep directory alive even empty
                            File r = SPIFFS.open(path + "/.", FILE_WRITE);
                            if (r)
                            {
                                r.close();
                            }
                        }
                    }
                    else
                    {
                        status = "Cannot deleted ";
                        status += shortname;
                    }
                }
            }
            // delete a directory
            if (_webserver->arg("action") == "deletedir" && _webserver->hasArg("filename"))
            {
                String filename;
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename = path + _webserver->arg("filename");
                filename += "/";
                filename.replace("//", "/");
                if (filename != "/")
                {
                    bool delete_error = false;
                    File dir = SPIFFS.open(path + shortname);
                    {
                        File file2deleted = dir.openNextFile();
                        while (file2deleted)
                        {
                            String fullpath = file2deleted.name();
                            if (!SPIFFS.remove(fullpath))
                            {
                                delete_error = true;
                                status = "Cannot deleted ";
                                status += fullpath;
                            }
                            file2deleted = dir.openNextFile();
                        }
                    }
                    if (!delete_error)
                    {
                        status = shortname;
                        status += " deleted";
                    }
                }
            }

            // create a directory
            if (_webserver->arg("action") == "createdir" && _webserver->hasArg("filename"))
            {
                String filename;
                filename = path + _webserver->arg("filename") + "/.";
                String shortname = _webserver->arg("filename");
                shortname.replace("/", "");
                filename.replace("//", "/");
                if (SPIFFS.exists(filename))
                {
                    status = shortname + " already exists!";
                }
                else
                {
                    File r = SPIFFS.open(filename, FILE_WRITE);
                    if (!r)
                    {
                        status = "Cannot create ";
                        status += shortname;
                    }
                    else
                    {
                        r.close();
                        status = shortname + " created";
                    }
                }
            }
        }

        String ptmp = path;
        if ((path != "/") && (path[path.length() - 1] = '/'))
        {
            ptmp = path.substring(0, path.length() - 1);
        }

        File dir = SPIFFS.open(ptmp);
        JSONencoder encoder;
        encoder.begin();
        encoder.begin_array("files");
        String subdirlist = "";
        File fileparsed = dir.openNextFile();
        while (fileparsed)
        {
            String filename = fileparsed.name();
            String size = "";
            bool addtolist = true;
            // remove path from name
            filename = filename.substring(path.length(), filename.length());
            // check if file or subfile
            if (filename.indexOf("/") > -1)
            {
                // Do not rely on "/." to define directory as SPIFFS upload won't create it but directly files
                // and no need to overload SPIFFS if not necessary to create "/." if no need
                // it will reduce SPIFFS available space so limit it to creation
                filename = filename.substring(0, filename.indexOf("/"));
                String tag = "*";
                tag += filename + "*";
                if (subdirlist.indexOf(tag) > -1 || filename.length() == 0)
                {                      // already in list
                    addtolist = false; // no need to add
                }
                else
                {
                    size = "-1"; // it is subfile so display only directory, size will be -1 to describe it is directory
                    if (subdirlist.length() == 0)
                    {
                        subdirlist += "*";
                    }
                    subdirlist += filename + "*"; // add to list
                }
            }
            else
            {
                // do not add "." file
                if (!((filename == ".") || (filename == "")))
                {
                    size = ESPResponseStream::formatBytes(fileparsed.size());
                }
                else
                {
                    addtolist = false;
                }
            }
            if (addtolist)
            {
                encoder.begin_object();
                encoder.member("name", filename);
                encoder.member("size", size);
                encoder.end_object();
            }
            fileparsed = dir.openNextFile();
        }
        encoder.end_array();
        encoder.member("path", path);
        encoder.member(JSONencoder::status, JSONencoder::ok);
        size_t totalBytes;
        size_t usedBytes;
        totalBytes = SPIFFS.totalBytes();
        usedBytes = SPIFFS.usedBytes();
        encoder.member("total", ESPResponseStream::formatBytes(totalBytes));
        encoder.member("used", ESPResponseStream::formatBytes(usedBytes));
        encoder.member("occupation", String(100 * usedBytes / totalBytes));
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end());
    }

    // push error code and message to websocket
    void Web_Server::pushError(int code, const char *st, bool web_error, uint16_t timeout)
    {
        if (_socket_server && st)
        {
            String s = "ERROR:" + String(code) + ":";
            s += st;
            _socket_server->sendTXT(_id_connection, s);
            if (web_error != 0 && _webserver && _webserver->client().available() > 0)
            {
                sendStatus(web_error, s);
            }

            uint32_t t = millis();
            while (millis() - t < timeout)
            {
                _socket_server->loop();
                delay(10);
            }
        }
    }

