iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
        uint32_t occupedspace = 1;
        uint32_t usedspace2 = usedspace / (1024 * 1024);
        uint32_t totalspace2 = totalspace / (1024 * 1024);
        occupedspace = (usedspace2 * 100) / totalspace2;
        // minimum if even one byte is used is 1%
        if (occupedspace <= 1)
        {
            occupedspace = 1;
        }
        if (totalspace)
        {
            encoder.member("total", stotalspace);
        }
        else
        {
            encoder.member("total", "-1");
        }
        encoder.member("used", susedspace);
        if (totalspace)
        {
            encoder.member("occupation", String(occupedspace));
        }
        else
        {
            encoder.member("occupation", "-1");
        }
        encoder.member("mode", "direct");
        encoder.member(JSONencoder::status, sstatus);
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(200, "application/json", encoder.end());
        set_sd_state(SDState::Idle);
        SD.end();
    }

    // SD File upload with direct access to SD///////////////////////////////
    void Web_Server::SDFile_direct_upload()
    {
        static String filename;
        static File sdUploadFile;
        // this is only for admin and user
        if (is_authenticated() == AuthenticationLevel::LEVEL_GUEST)
        {
            _upload_status = UploadStatusType::FAILED;
            sendStatus(401, "Authentication failed");
            pushError(ESP_ERROR_AUTHENTICATION, "Upload rejected", 401);
        }
        else
        {
            // retrieve current file id
            HTTPUpload &upload = _webserver->upload();
            if ((_upload_status != UploadStatusType::FAILED) || (upload.status == UPLOAD_FILE_START))
            {
                // Upload start
                //**************
                if (upload.status == UPLOAD_FILE_START)
                {
                    _upload_status = UploadStatusType::ONGOING;
                    filename = upload.filename;
                    // on SD need to add / if not present
                    if (filename[0] != '/')
                    {
                        filename = "/" + upload.filename;
                    }
                    // check if SD Card is available
                    if (get_sd_state(true) != SDState::Idle)
                    {
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload cancelled]\r\n");
                        pushError(ESP_ERROR_UPLOAD_CANCELLED, "Upload cancelled", 500);
                    }
                    else
                    {
                        set_sd_state(SDState::BusyUploading);
                        // delete file on SD Card if already present
                        if (SD.exists(filename))
                        {
                            SD.remove(filename);
                        }
                        String sizeargname = upload.filename + "S";
                        if (_webserver->hasArg(sizeargname))
                        {
                            uint32_t filesize = _webserver->arg(sizeargname).toInt();
                            uint64_t freespace = SD.totalBytes() - SD.usedBytes();
                            if (filesize > freespace)
                            {
                                _upload_status = UploadStatusType::FAILED;
                                grbl_send(CLIENT_ALL, "[MSG:Upload error]\r\n");
                                pushError(ESP_ERROR_NOT_ENOUGH_SPACE, "Upload rejected, not enough space", 507);
                            }
                        }
                        if (_upload_status != UploadStatusType::FAILED)
                        {
                            // Create file for writing
                            sdUploadFile = SD.open(filename, FILE_WRITE);
                            // check if creation succeed
                            if (!sdUploadFile)
                            {
                                // if creation failed
                                _upload_status = UploadStatusType::FAILED;
                                grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                                pushError(ESP_ERROR_FILE_CREATION, "File creation failed", 500);
                            }
                            // if creation succeed set flag UploadStatusType::ONGOING
                            else
                            {
                                _upload_status = UploadStatusType::ONGOING;
                            }
                        }
                    }
                    // Upload write
                    //**************
                }
                else if (upload.status == UPLOAD_FILE_WRITE)
                {
                    vTaskDelay(1 / portTICK_RATE_MS);
                    if (sdUploadFile && (_upload_status == UploadStatusType::ONGOING) && (get_sd_state(false) == SDState::BusyUploading))
                    {
                        // no error write post data
                        if (upload.currentSize != sdUploadFile.write(upload.buf, upload.currentSize))
                        {
                            _upload_status = UploadStatusType::FAILED;
                            grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                            pushError(ESP_ERROR_FILE_WRITE, "File write failed", 500);
                        }
                    }
                    else
                    { // if error set flag UploadStatusType::FAILED
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                        pushError(ESP_ERROR_FILE_WRITE, "File write failed", 500);
                    }
                    // Upload end
                    //**************
                }
                else if (upload.status == UPLOAD_FILE_END)
                {
                    // if file is open close it
                    if (sdUploadFile)
                    {
                        sdUploadFile.close();
                        // TODO Check size
                        String sizeargname = upload.filename + "S";
                        if (_webserver->hasArg(sizeargname))
                        {
                            uint32_t filesize = 0;
                            sdUploadFile = SD.open(filename, FILE_READ);
                            filesize = sdUploadFile.size();
                            sdUploadFile.close();
                            if (_webserver->arg(sizeargname) != String(filesize))
                            {
                                _upload_status = UploadStatusType::FAILED;
                                pushError(ESP_ERROR_UPLOAD, "File upload mismatch", 500);
                                grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                            }
                        }
                    }
                    else
                    {
                        _upload_status = UploadStatusType::FAILED;
                        grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                        pushError(ESP_ERROR_FILE_CLOSE, "File close failed", 500);
                    }
                    if (_upload_status == UploadStatusType::ONGOING)
                    {
                        _upload_status = UploadStatusType::SUCCESSFUL;
                        set_sd_state(SDState::Idle);
                    }
                    else
                    {
                        _upload_status = UploadStatusType::FAILED;
                        pushError(ESP_ERROR_UPLOAD, "Upload error", 500);
                    }
                }
                else
                { // Upload cancelled
                    _upload_status = UploadStatusType::FAILED;
                    set_sd_state(SDState::Idle);
                    grbl_send(CLIENT_ALL, "[MSG:Upload failed]\r\n");
                    if (sdUploadFile)
                    {
                        sdUploadFile.close();
                    }
                    SD.end();
                    return;
                }
            }
        }
        if (_upload_status == UploadStatusType::FAILED)
        {
            cancelUpload();
            if (sdUploadFile)
            {
                sdUploadFile.close();
            }
            if (SD.exists(filename))
            {
                SD.remove(filename);
            }
            set_sd_state(SDState::Idle);
        }
        COMMANDS::wait(0);
    }
#endif

    void Web_Server::handle()
    {
        static uint32_t timeout = millis();
        COMMANDS::wait(0);
#ifdef ENABLE_CAPTIVE_PORTAL
        if (WiFi.getMode() == WIFI_AP)
        {
            dnsServer.processNextRequest();
        }
#endif
        if (_webserver)
        {
            _webserver->handleClient();
        }
        if (_socket_server && _setupdone)
        {
            _socket_server->loop();
        }
        if ((millis() - timeout) > 10000 && _socket_server)
        {
            String s = "PING:";
            s += String(_id_connection);
            _socket_server->broadcastTXT(s);
            timeout = millis();
        }
    }

    void Web_Server::handle_Websocket_Event(uint8_t num, uint8_t type, uint8_t *payload, size_t length)
    {
        switch (type)
        {
        case WStype_DISCONNECTED:
            // USE_SERIAL.printf("[%u] Disconnected!\n", num);
            grbl_send(CLIENT_SERIAL, "WebUI Disconnected!\n");
            break;
        case WStype_CONNECTED:
        {
            IPAddress ip = _socket_server->remoteIP(num);
            // USE_SERIAL.printf("[%u] Connected from %d.%d.%d.%d url: %s\n", num, ip[0], ip[1], ip[2], ip[3], payload);
            String s = "CURRENT_ID:" + String(num);
            // send message to client
            _id_connection = num;
            _socket_server->sendTXT(_id_connection, s);
            s = "ACTIVE_ID:" + String(_id_connection);
            _socket_server->broadcastTXT(s);

            grbl_send(CLIENT_SERIAL, "WebUI connected!\n");
        }
        break;
        case WStype_TEXT:
            // USE_SERIAL.printf("[%u] get Text: %s\n", num, payload);

            // send message to client
            _socket_server->sendTXT(_id_connection, "got it");

