iherbak/MKS-DLC32-FIRMWARE/Firmware/Grbl_Esp32/src/WebUI/WebServer.cpp
            // send data to all connected clients
            // webSocket.broadcastTXT("message here");
            break;
        case WStype_BIN:
            // USE_SERIAL.printf("[%u] get binary length: %u\n", num, length);
            // hexdump(payload, length);

            // send message to client
            // webSocket.sendBIN(num, payload, length);
            break;
        default:
            break;
        }
    }

    // The separator that is passed in to this function is always '\n'
    // The string that is returned does not contain the separator
    // The calling code adds back the separator, unless the string is
    // a one-character realtime command.
    String Web_Server::get_Splited_Value(String data, char separator, int index)
    {
        int found = 0;
        int strIndex[] = {0, -1};
        int maxIndex = data.length() - 1;

        for (int i = 0; i <= maxIndex && found <= index; i++)
        {
            if (data.charAt(i) == separator || i == maxIndex)
            {
                found++;
                strIndex[0] = strIndex[1] + 1;
                strIndex[1] = (i == maxIndex) ? i + 1 : i;
            }
        }

        return found > index ? data.substring(strIndex[0], strIndex[1]) : "";
    }

    // helper to extract content type from file extension
    // Check what is the content tye according extension file
    String Web_Server::getContentType(String filename)
    {
        String file_name = filename;
        file_name.toLowerCase();
        if (filename.endsWith(".htm"))
        {
            return "text/html";
        }
        else if (file_name.endsWith(".html"))
        {
            return "text/html";
        }
        else if (file_name.endsWith(".css"))
        {
            return "text/css";
        }
        else if (file_name.endsWith(".js"))
        {
            return "application/javascript";
        }
        else if (file_name.endsWith(".png"))
        {
            return "image/png";
        }
        else if (file_name.endsWith(".gif"))
        {
            return "image/gif";
        }
        else if (file_name.endsWith(".jpeg"))
        {
            return "image/jpeg";
        }
        else if (file_name.endsWith(".jpg"))
        {
            return "image/jpeg";
        }
        else if (file_name.endsWith(".ico"))
        {
            return "image/x-icon";
        }
        else if (file_name.endsWith(".xml"))
        {
            return "text/xml";
        }
        else if (file_name.endsWith(".pdf"))
        {
            return "application/x-pdf";
        }
        else if (file_name.endsWith(".zip"))
        {
            return "application/x-zip";
        }
        else if (file_name.endsWith(".gz"))
        {
            return "application/x-gzip";
        }
        else if (file_name.endsWith(".txt"))
        {
            return "text/plain";
        }
        return "application/octet-stream";
    }

    // check authentification
    AuthenticationLevel Web_Server::is_authenticated()
    {
#ifdef ENABLE_AUTHENTICATION
        if (_webserver->hasHeader("Cookie"))
        {
            String cookie = _webserver->header("Cookie");
            int pos = cookie.indexOf("ESPSESSIONID=");
            if (pos != -1)
            {
                int pos2 = cookie.indexOf(";", pos);
                String sessionID = cookie.substring(pos + strlen("ESPSESSIONID="), pos2);
                IPAddress ip = _webserver->client().remoteIP();
                // check if cookie can be reset and clean table in same time
                return ResetAuthIP(ip, sessionID.c_str());
            }
        }
        return AuthenticationLevel::LEVEL_GUEST;
#else
        return AuthenticationLevel::LEVEL_ADMIN;
#endif
    }

#ifdef ENABLE_AUTHENTICATION

    // add the information in the linked list if possible
    bool Web_Server::AddAuthIP(AuthenticationIP *item)
    {
        if (_nb_ip > MAX_AUTH_IP)
        {
            return false;
        }
        item->_next = _head;
        _head = item;
        _nb_ip++;
        return true;
    }

    // Session ID based on IP and time using 16 char
    char *Web_Server::create_session_ID()
    {
        static char sessionID[17];
        // reset SESSIONID
        for (int i = 0; i < 17; i++)
        {
            sessionID[i] = '\0';
        }
        // get time
        uint32_t now = millis();
        // get remote IP
        IPAddress remoteIP = _webserver->client().remoteIP();
        // generate SESSIONID
        if (0 > sprintf(sessionID,
                        "%02X%02X%02X%02X%02X%02X%02X%02X",
                        remoteIP[0],
                        remoteIP[1],
                        remoteIP[2],
                        remoteIP[3],
                        (uint8_t)((now >> 0) & 0xff),
                        (uint8_t)((now >> 8) & 0xff),
                        (uint8_t)((now >> 16) & 0xff),
                        (uint8_t)((now >> 24) & 0xff)))
        {
            strcpy(sessionID, "NONE");
        }
        return sessionID;
    }

    bool Web_Server::ClearAuthIP(IPAddress ip, const char *sessionID)
    {
        AuthenticationIP *current = _head;
        AuthenticationIP *previous = NULL;
        bool done = false;
        while (current)
        {
            if ((ip == current->ip) && (strcmp(sessionID, current->sessionID) == 0))
            {
                // remove
                done = true;
                if (current == _head)
                {
                    _head = current->_next;
                    _nb_ip--;
                    delete current;
                    current = _head;
                }
                else
                {
                    previous->_next = current->_next;
                    _nb_ip--;
                    delete current;
                    current = previous->_next;
                }
            }
            else
            {
                previous = current;
                current = current->_next;
            }
        }
        return done;
    }

    // Get info
    AuthenticationIP *Web_Server::GetAuth(IPAddress ip, const char *sessionID)
    {
        AuthenticationIP *current = _head;
        // AuthenticationIP * previous = NULL;
        // get time
        // uint32_t now = millis();
        while (current)
        {
            if (ip == current->ip)
            {
                if (strcmp(sessionID, current->sessionID) == 0)
                {
                    // found
                    return current;
                }
            }
            // previous = current;
            current = current->_next;
        }
        return NULL;
    }

    // Review all IP to reset timers
    AuthenticationLevel Web_Server::ResetAuthIP(IPAddress ip, const char *sessionID)
    {
        AuthenticationIP *current = _head;
        AuthenticationIP *previous = NULL;
        // get time
        // uint32_t now = millis();
        while (current)
        {
            if ((millis() - current->last_time) > 360000)
            {
                // remove
                if (current == _head)
                {
                    _head = current->_next;
                    _nb_ip--;
                    delete current;
                    current = _head;
                }
                else
                {
                    previous->_next = current->_next;
                    _nb_ip--;
                    delete current;
                    current = previous->_next;
                }
            }
            else
            {
                if (ip == current->ip && strcmp(sessionID, current->sessionID) == 0)
                {
                    // reset time
                    current->last_time = millis();
                    return (AuthenticationLevel)current->level;
                }
                previous = current;
                current = current->_next;
            }
        }
        return AuthenticationLevel::LEVEL_GUEST;
    }
#endif
    // push error code and message to websocket
    void Web_Server::sendStatus(int httpCode, String status)
    {
        JSONencoder encoder;
        encoder.begin();
        encoder.member(JSONencoder::status, status);
        _webserver->sendHeader("Cache-Control", "no-cache");
        _webserver->send(httpCode, "application/json", encoder.end());
    }
}
#endif // Enable HTTP && ENABLE_WIFI
